IlleniumDillon/MM32F5277/PinMap/MM32_UART_PinMap.c
#include "MM32_UART_PinMap.h"

MM32_UART_Pin UART1_TX_PA9 = {.periBase = UART1, .port = GPIOA, .pin = P09, .af = AF07};
MM32_UART_Pin UART1_RX_PA10 = {.periBase = UART1, .port = GPIOA, .pin = P10, .af = AF07};
MM32_UART_Pin UART1_CTS_PA11 = {.periBase = UART1, .port = GPIOA, .pin = P11, .af = AF07};
MM32_UART_Pin UART1_RTS_PA12 = {.periBase = UART1, .port = GPIOA, .pin = P12, .af = AF07};
MM32_UART_Pin UART1_TX_PB6 = {.periBase = UART1, .port = GPIOB, .pin = P06, .af = AF07};
MM32_UART_Pin UART1_RX_PB7 = {.periBase = UART1, .port = GPIOB, .pin = P07, .af = AF07};
MM32_UART_Pin UART1_CTS_PB8 = {.periBase = UART1, .port = GPIOB, .pin = P08, .af = AF07};
MM32_UART_Pin UART1_RTS_PB9 = {.periBase = UART1, .port = GPIOB, .pin = P09, .af = AF07};
MM32_UART_Pin UART1_TX_PC4 = {.periBase = UART1, .port = GPIOC, .pin = P04, .af = AF07};
MM32_UART_Pin UART1_RX_PC5 = {.periBase = UART1, .port = GPIOC, .pin = P05, .af = AF07};

MM32_UART_Pin UART2_CTS_PA0 = {.periBase = UART2, .port = GPIOA, .pin = P00, .af = AF07};
MM32_UART_Pin UART2_RTS_PA1 = {.periBase = UART2, .port = GPIOA, .pin = P01, .af = AF07};
MM32_UART_Pin UART2_TX_PA2 = {.periBase = UART2, .port = GPIOA, .pin = P02, .af = AF07};
MM32_UART_Pin UART2_RX_PA3 = {.periBase = UART2, .port = GPIOA, .pin = P03, .af = AF07};
MM32_UART_Pin UART2_CTS_PD3 = {.periBase = UART2, .port = GPIOD, .pin = P03, .af = AF07};
MM32_UART_Pin UART2_RTS_PD4 = {.periBase = UART2, .port = GPIOD, .pin = P04, .af = AF07};
MM32_UART_Pin UART2_TX_PD5 = {.periBase = UART2, .port = GPIOD, .pin = P05, .af = AF07};
MM32_UART_Pin UART2_RX_PD6 = {.periBase = UART2, .port = GPIOD, .pin = P06, .af = AF07};

MM32_UART_Pin UART3_TX_PB10 = {.periBase = UART3, .port = GPIOB, .pin = P10, .af = AF07};
MM32_UART_Pin UART3_RX_PB11 = {.periBase = UART3, .port = GPIOB, .pin = P11, .af = AF07};
MM32_UART_Pin UART3_CTS_PB13 = {.periBase = UART3, .port = GPIOB, .pin = P13, .af = AF07};
MM32_UART_Pin UART3_RTS_PB14 = {.periBase = UART3, .port = GPIOB, .pin = P14, .af = AF07};
MM32_UART_Pin UART3_TX_PC10 = {.periBase = UART3, .port = GPIOC, .pin = P10, .af = AF07};
MM32_UART_Pin UART3_RX_PC11 = {.periBase = UART3, .port = GPIOC, .pin = P11, .af = AF07};
MM32_UART_Pin UART3_TX_PD8 = {.periBase = UART3, .port = GPIOD, .pin = P08, .af = AF07};
MM32_UART_Pin UART3_RX_PD9 = {.periBase = UART3, .port = GPIOD, .pin = P09, .af = AF07};
MM32_UART_Pin UART3_CTS_PD11 = {.periBase = UART3, .port = GPIOD, .pin = P11, .af = AF07};
MM32_UART_Pin UART3_RTS_PD12 = {.periBase = UART3, .port = GPIOD, .pin = P12, .af = AF07};

MM32_UART_Pin UART4_TX_PA0 = {.periBase = UART4, .port = GPIOA, .pin = P00, .af = AF08};
MM32_UART_Pin UART4_RX_PA1 = {.periBase = UART4, .port = GPIOA, .pin = P01, .af = AF08};
MM32_UART_Pin UART4_CTS_PA14 = {.periBase = UART4, .port = GPIOA, .pin = P14, .af = AF08};
MM32_UART_Pin UART4_RTS_PA15 = {.periBase = UART4, .port = GPIOA, .pin = P15, .af = AF08};
MM32_UART_Pin UART4_TX_PC0 = {.periBase = UART4, .port = GPIOC, .pin = P00, .af = AF08};
MM32_UART_Pin UART4_RX_PC1 = {.periBase = UART4, .port = GPIOC, .pin = P01, .af = AF08};
MM32_UART_Pin UART4_CTS_PC2 = {.periBase = UART4, .port = GPIOC, .pin = P02, .af = AF08};
MM32_UART_Pin UART4_RTS_PC3 = {.periBase = UART4, .port = GPIOC, .pin = P03, .af = AF08};
MM32_UART_Pin UART4_TX_PC10 = {.periBase = UART4, .port = GPIOC, .pin = P10, .af = AF08};
MM32_UART_Pin UART4_RX_PC11 = {.periBase = UART4, .port = GPIOC, .pin = P11, .af = AF08};

MM32_UART_Pin UART5_TX_PA4 = {.periBase = UART5, .port = GPIOA, .pin = P04, .af = AF08};
MM32_UART_Pin UART5_RX_PA5 = {.periBase = UART5, .port = GPIOA, .pin = P05, .af = AF08};
MM32_UART_Pin UART5_CTS_PB3 = {.periBase = UART5, .port = GPIOB, .pin = P03, .af = AF08};
MM32_UART_Pin UART5_RTS_PB4 = {.periBase = UART5, .port = GPIOB, .pin = P04, .af = AF08};
MM32_UART_Pin UART5_TX_PC12 = {.periBase = UART5, .port = GPIOC, .pin = P12, .af = AF08};
MM32_UART_Pin UART5_RX_PD2 = {.periBase = UART5, .port = GPIOD, .pin = P02, .af = AF08};

MM32_UART_Pin UART6_TX_PB0 = {.periBase = UART6, .port = GPIOB, .pin = P00, .af = AF08};
MM32_UART_Pin UART6_RX_PB1 = {.periBase = UART6, .port = GPIOB, .pin = P01, .af = AF08};
MM32_UART_Pin UART6_TX_PC6 = {.periBase = UART6, .port = GPIOC, .pin = P06, .af = AF08};
MM32_UART_Pin UART6_RX_PC7 = {.periBase = UART6, .port = GPIOC, .pin = P07, .af = AF08};
MM32_UART_Pin UART6_RTS_PG8 = {.periBase = UART6, .port = GPIOG, .pin = P08, .af = AF08};
MM32_UART_Pin UART6_RX_PG9 = {.periBase = UART6, .port = GPIOG, .pin = P09, .af = AF08};
MM32_UART_Pin UART6_RTS_PG12 = {.periBase = UART6, .port = GPIOG, .pin = P12, .af = AF08};
MM32_UART_Pin UART6_CTS_PG13 = {.periBase = UART6, .port = GPIOG, .pin = P13, .af = AF08};
MM32_UART_Pin UART6_TX_PG14 = {.periBase = UART6, .port = GPIOG, .pin = P14, .af = AF08};
MM32_UART_Pin UART6_CTS_PG15 = {.periBase = UART6, .port = GPIOG, .pin = P15, .af = AF08};

MM32_UART_Pin UART7_TX_PB6 = {.periBase = UART7, .port = GPIOB, .pin = P06, .af = AF08};
MM32_UART_Pin UART7_RX_PB7 = {.periBase = UART7, .port = GPIOB, .pin = P07, .af = AF08};
MM32_UART_Pin UART7_RX_PE7 = {.periBase = UART7, .port = GPIOE, .pin = P07, .af = AF08};
MM32_UART_Pin UART7_TX_PE8 = {.periBase = UART7, .port = GPIOE, .pin = P08, .af = AF08};
MM32_UART_Pin UART7_RX_PF6 = {.periBase = UART7, .port = GPIOF, .pin = P06, .af = AF08};
MM32_UART_Pin UART7_TX_PF7 = {.periBase = UART7, .port = GPIOF, .pin = P07, .af = AF08};